{"id": "2304ed09-4933-4277-9048-d5d0394e24e3", "owner_id": "8c3a5b30-a073-48c3-a334-f26f40a8ba67", "parent_id": null, "slug": "pitch-letterboxd-para-partidas-de-futebol-em-5-dias", "title": "Pitch: Letterboxd para partidas de futebol em 5 dias", "body": "Fala, galera! Tudo em ordem? Depois de 5 dias de ideação, design e desenvolvimento, eu e dois amigos metidos a Indie Hackers (um dev front e outro back) colocamos no ar o **Sportboxd** – um app que nasceu da nossa paixão por futebol e da vontade de criar algo simples e útil para os fãs de esporte. 🎉\n\nO Sportboxd é uma plataforma onde você pode avaliar partidas, escrever resenhas e ver o que a galera tá dizendo sobre os jogos. Se você conhece o Letterboxd (para filmes), a ideia é parecida (o nome também rsrs), só que pra partidas de futebol.\n\n## **De onde veio a ideia?**\n\nUm dia eu tava navegando no Twitter e li um tweet gringo falando *\"Hear me out, a Letterboxd but for football matches\"*, e quando eu pesquisei essa mesma no próprio Twitter tinha uma porrada de gente falando a mesmíssima coisa, então além de achar genial eu vi que talvez existisse demanda pra essa brincadeira, então já chamei esses parceiros no Whatsapp e eles toparam fazer\n\nDecidimos que o desenvolvimento do MVP tinha que ser em poucos dias e que iríamos investir o mínimo do mínimo de dinheiro, o objetivo é colocar no mundo e ver no que vai dar\n\n## **MVP**\nCom um prazo apertado e pouca margem pra complicar, focamos no essencial:\n\n- Avaliar jogos com notas e resenha.\n- Acessar tudo com login via Google\n- Compartilhar a resenha nas redes sociais\n- Um design direto ao ponto, bonito e funcional.\n\n\n\n## **Processo de desenvolvimento**\n\nSomos do Rio de Janeiro e desde sexta-feira 15 até amanhã (quarta-feira 20) é feriado aqui por causa do G20, ou seja, 6 dias livres pra desenvolver, acompanha aí a jornada\n\n*Sexta-feira*\n- Pela manhã eu comecei os wireframes e no fim da tarde já tinha o design do app em alta-fidelidade no Figma\n- A noite me reuni com o Lucas (Back-end) pra ajustar algumas coisas baseados e estudar quais dados que iriamos puxar pra popular o app, como ligas, partidas históricas etc, enquanto isso ele já tocava a API em paralelo \n\n![texto](https://pbs.twimg.com/media/GcxpCZGXkAEzpTR?format=jpg&name=small)\n\n**O que o Lucas fez e usou no back-end:**\n\n- FastAPI pra construção da nossa API\n- ⁠Busca de partidas via web scraping em python (quase 10000 partidas)\n- ⁠AWS Lambda pra atualização das partidas em curto espaço de tempo\n- ⁠Load balancer distribuindo as requisições em múltiplos serviços\n- ⁠Integração com Firebase pra proteger as rotas\n- ⁠Integração com Perspective API pra detectar possíveis comentários com discurso de ódio, racismo, homofobia entre outras merdas com Machine Learning\n\n\n*Sábado*\n- Durante o dia inteiro Arthur (Front-end) começou a dar vida ao design em pair programming com o Lucas pra tudo ficar alinhado\n- A noite nos reunimos pra tomar algumas decisões, como por exemplo ter login, a gente ia lançar sem mas eu insisti que seria burrice e a gente decidiu por fazer com Firebase\n\n![texto](https://pbs.twimg.com/media/Gcxp7t1XwAAtvRX?format=jpg&name=small)\n\n**O que o Arthur fez e usou no front:**\n\n- Vite.js em Typescript \n- ⁠Tailwindcss para estilização das interfaces \n- ⁠Integração com o Firebase para autenticação dos usuários\n- Integração com Google Ads\n- integração com API c/ React Query para gerenciar estados das queries e caching\n- ⁠Zod e React Hook Form para validação de formulários\n\n*Domingo*\n- Comecei a pensar na estratégia de lançamento, com criativos, ads, microinfluencers e tudo mais (até agora não tenho uma estratégia clara kk) enquanto o Arthur integrava o Firebase pra enfim termos um login\n- A noite nos reunimos de novo pra refinar e pensar em como resolver um problema que a gente encontrou, a busca das partidas não entregava os escudos dos times, então eu sugeri scraping no Wikipedia e o Lucas fez o script pra pesquisa no google e pronto habemus escudos\n\n\n*Segunda-feira*\n- Quase tudo redondinho, parti pra fazer QA e o Arthur foi varrendo os erros e problemas em paralelo comigo\n- Implementamos um sistema de moderação pra evitar resenhas com discurso de ódio, racismo e todo esse tipo de coisa com a Perspective API do Google\n\n![texto](https://pbs.twimg.com/media/GcxzJ8IXkAAPeGW?format=jpg&name=small)\n\nO sistema não é o melhor do mundo como vocês podem ver mas vai ajudar a segurar a onda de uma possível galera pau no cu enquanto a gente não implementa um mecanismo de automoderação com denúncias de reviews e ta\n\n*Hoje*\n- Compramos o domínio por 1 centavo na promoção da Godaddy\n- Hospedamos o site\n- Nasce o Sportboxd!\n\n\n## **GO LIVE**\nBom, agora estamos no ar e vamo ver no que vai dar\nJá da pra ir lá comentar o que você tá achando dessa partida aí do Curintha e Cruzeiro hoje\nOFICIALMENTE NO AR O SPORTBOXD\nacessa aí acessa aí\n\nhttps://www.sportboxd.com/\n-\n\nSe alguém aqui curtiu a idéia e quiser colaborar com a gente me chama aí ou dá uma moral lá no apoia.se/sportboxd", "status": "published", "type": "content", "source_url": "https://www.sportboxd.com/", "created_at": "2024-11-20T15:11:58.166Z", "updated_at": "2024-11-20T15:12:38.877Z", "published_at": "2024-11-20T15:11:58.175Z", "deleted_at": null, "owner_username": "gustavohpss", "tabcoins": 16, "tabcoins_credit": 15, "tabcoins_debit": 0, "children_deep_count": 19}